// Написать программу которая из имеющегося массива строк формирует массив из строк,
// длина которых меньше либо равна 3.
Console.Clear();
Console.WriteLine("Программа которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3.");
Console.WriteLine("Добро пожаловать!");
Console.WriteLine();